# Завдання_1
# Створити список материків західної півкулі. Доповнити список материками зі східної півкулі. Відсортувати материки за
# алфавітом і вивести на екран.

west = ["Північна Америка", "Південна Америка", "Антарктида"]
east = ["Африка", "Євразія", "Австралія"]
west.extend(east)
print(sorted(west))


# Завдання_2
# Створити список, елементами якого є інші списки, що містять інформацію про ім’я та прізвище студентів.
# Порахувати скільки людей мають ім’я «Андрій»


names = [['Andrey', 'Egor'], ['Roma', 'Vasiliy'], ['Pasha', 'Andrey'], ['Kostya', 'Vova']]
count = 0           #count возвращает количество раз, когда объект появляется в списке.
for name in names:
    if name.count('Andrey'):
        count += 1
print(count)